quick-start-guide/src/main/resources/scenarios/Common/add-cameron.xml

 <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.ws.um.carbon.wso2.org" xmlns:xsd="http://common.mgt.user.carbon.wso2.org/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:addUser>
            <!--Optional:-->
            <ser:userName>cameron@wso2.com</ser:userName>
            <!--Optional:-->
            <ser:credential>cameron!23</ser:credential>
            <!--Zero or more repetitions:-->
            <ser:roleList>default</ser:roleList>
            <!--Zero or more repetitions:-->
            <ser:claims>
                <!--Optional:-->
                <xsd:claimURI>http://wso2.org/claims/emailaddress</xsd:claimURI>
                <!--Optional:-->
                <xsd:value>cameron@testsamlusr.com</xsd:value>
            </ser:claims>
            <!--Optional:-->
            <ser:profileName>default</ser:profileName>
            <ser:requirePasswordChange>false</ser:requirePasswordChange>
        </ser:addUser>
    </soapenv:Body>
</soapenv:Envelope>
